Config/DataProcessors/ПомощникЗагрузкиФорматовОбменаБанкиКС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПомощникЗагрузкиФорматовОбменаБанкиКС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущееСостояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФайлыФорматов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресФайлаВХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/DataProcessors/ПомощникЗагрузкиФорматовОбменаБанкиКС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
	
// Читает только заголовок, извлекая лишь комментарий, имена объектов (справочников, записей и тп), 
//  а также количество объектов каждого объекта
//
// Возвращает Истина, если структура заголовка соответствует
//
Функция ПолучитьСвойстваФайлаЗагрузки(Знач ИмяФайла) Экспорт
	
	Попытка
		
		ФайлыФорматов.Очистить();
	
		Если ЭтоАдресВременногоХранилища(ИмяФайла) Тогда
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("defx");
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ИмяФайла);
			ДвоичныеДанные.Записать(ИмяВременногоФайла);
			РабИмяФайла = ИмяВременногоФайла;
			
		Иначе
			
			РабИмяФайла = ИмяФайла;
			
		КонецЕсли;
		
				
		Пакет = ПакетныеФайлыOPC.ЧтениеОткрыть(РабИмяФайла);
		СвойстваПакета = ПакетныеФайлыOPC.ЧтениеПолучитьСтруктуруЯдерныхСвойств(Пакет);
		
		Идентификатор 	= СвойстваПакета.Получить("dc:identifier");
		Комментарий 	= СвойстваПакета.Получить("dc:description");
		ДатаОбновления 	= XMLЗначение(Тип("Дата"), СвойстваПакета["dcterms:modified"]);
		
		// Если версия формата не указана, значит файл поставки был сформирован до 10 релиза,
		// а значит он нам не подходит. Начиная с 10 релиза, в версии будет указано значение "10".
		Версия		 	= СвойстваПакета.Получить("cp:version");
		Если Версия <> "10" Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если СтрНайти(Идентификатор, "urn:delivery-1c-ru:exchange:format") > 0 Тогда
			
			НоваяСтрока = ФайлыФорматов.Добавить();
			
			НоваяСтрока.Загружать 				= Истина;
			НоваяСтрока.ИмяФайла 				= Идентификатор;
			НоваяСтрока.Источник 				= РабИмяФайла;
			НоваяСтрока.Описание	 			= Комментарий;
			НоваяСтрока.Дата 					= ДатаОбновления;
			НоваяСтрока.АдресФайлаВХранилище 	= ИмяФайла;
			
		КонецЕсли;
		
	Исключение
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат ФайлыФорматов.Количество() > 0;
	
КонецФункции

Функция ЗагрузитьФайл(Знач ИмяФайла, Знач НеОбновлятьВидОбмена) Экспорт

	Результат                   = Истина; 
    МассивСправочникиИсключения = Новый Массив;	
	
	Если НеОбновлятьВидОбмена Тогда  
		МассивСправочникиИсключения.Добавить("ТипыОбменаБанкиКС");
	КонецЕсли;	
	
	Попытка
	
		Если ЭтоАдресВременногоХранилища(ИмяФайла) Тогда
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("defx");
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ИмяФайла);
			ДвоичныеДанные.Записать(ИмяВременногоФайла);
			РабИмяФайла = ИмяВременногоФайла;
			
		Иначе
			
			РабИмяФайла = ИмяФайла;
			
		КонецЕсли;
		
		Пакет = ПакетныеФайлыOPC.ЧтениеОткрыть(РабИмяФайла);
		СвязиПакета = ПакетныеФайлыOPC.ЧтениеПолучитьСвязиЧастиXDTO(Пакет, "");
		СвязьСЧастью = СвязиПакета.Получить("Relationship[Id='exf']");
		ИмяЧасти = СвязьСЧастью.Target;
		
		ЧтениеXML = ПакетныеФайлыOPC.ЧтениеПолучитьXMLЧасть(Пакет, ИмяЧасти);
		
		Результат = ВыгрузкаЗагрузкаСлужебныхДанных.УниверсальнаяЗагрузкаСправочников(ЧтениеXML, Истина, ,,,,, МассивСправочникиИсключения);
		
		ЧтениеXML.Закрыть();
		
	Исключение
		
		Результат = Ложь;
		
	КонецПопытки;
	
	Возврат Результат;

КонецФункции // ЗагрузитьФайл()
 
#КонецОбласти

#КонецЕсли
